Enterprise_Serivces/Prod/Bronze3/LoyaltyMerchandisingService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05/ILoyaltyMerchandisingService/GetMerchandisedProductDetails</wsa:Action><wsa:MessageID>uuid:daa43b56-d385-4706-8466-37381ac56f42</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslloyaltyprogramservicesqa1.testgs.pvt/LoyaltyMerchandisingService.svc</wsa:To></soap:Header><soap:Body><GetMerchandisedProductDetails xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CategoryType xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">Coupon</CategoryType><SKU xmlns="http://www.gamestop.com/services/csl/loyaltyprogram/contracts/messages/2010/11">334</SKU></request></GetMerchandisedProductDetails></soap:Body></soap:Envelope>